---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode.Default
enum: Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode
source: html/946277c7-6e1a-7f6a-7bd3-7693904e74fd.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldPrimitiveHideMode.Default

For ColoredSurface display style, hide only the referenced face passed at the primitive creation time.
 For DeformedShape display style, hide only the referenced face or curve passed at the primitive creation time.